/*:
 ## 演習問題：アイデンティティ
 
 インスタンスの値が独自のアイデンティティを持つとは、どのような意味でしょうか？

 - callout(演習): 
変数`myPlans`を作成し、初期値はあなたの夜の予定を説明する文字列にします。\
2つ目の変数`friendPlans`を作成し、初期値を`myPlans`にします。（予定を決めるのは、友達ではなく主にあなたです。）\
`friendPlans`の宣言の下で加算演算子`+`を使ってもう1つ活動を追加し、`myPlans`をアップデートしてください。\
`myPlans`と`friendPlans`の値を確認します。同じですか？それとも、違いますか？
 */
// ここで変数を作成してください。



// ここで`myPlans`をアップデートしてください。




/*:
 - callout(演習): 
文字列を取る関数`addDance`を作成し、ダンスに関するフレーズ（`"and then we dance!"`や`"but no dancing"`など、好きなもの）を追加して新しい文字列を返します。\
`myPlans`で`addDance`関数を呼び出し、結果を`friendPlans`に代入します。
 */
// ここで関数を定義して呼び出してください。




/*:
 - callout(演習): 
`friendPlans`はどのように変わると思いますか？`myPlans`はどのように変わると思いますか？\
 両方のインスタンスを出力して調べましょう。
 */
// ここで出力し、予想どおりかどうかチェックしてください。




/*:
 
 _Copyright © 2017 Apple Inc._
 
 _このソフトウェアおよび関連する文書ファイル（以下「ソフトウェア」という）の複製を入手した個人が、ソフトウェアを制限なく扱うこと（ソフトウェアの複製を使用、複製、修正、統合、公開、配布、サブライセンス、および販売を行う権利を含むがこれらに限定されない）およびソフトウェアを提供された個人にこれを行うことを許可することを、次の条件に基づいて無償で付与されます。_
 
 _上記の著作権通知とこの許可通知は、ソフトウェアのすべての複製または重要な部分に記載する必要があります。_
 
 _ソフトウェアは、明示的または暗黙的にかかわらず、いかなる保証を伴わず現状のまま提供されます。こうした保証には市場性、特定目的への適合性、および権利を侵害していないことに関する保証が含まれますがこれに限りません。作者または著作権所有者は、いかなる場合も、ソフトウェアに起因または関連する、もしくはソフトウェアの使用またはその他の取り扱いによるいかなる要求、損害またはその他の義務に対する責務を、契約や不法行為その他の行動の有無にかかわらず負いません。_
 */
//: [前ヘ](@previous)  |  17／17ページ
