/*:
 ## 演習問題：値の表示
 
 以前、iPhoneの空きスペースの計算に関するPlaygroundの演習問題に取り組みました。以下の情報を確認しましたね。
 
 - iPhoneの容量はギガバイト（GB）で計測します。問題で使用されるiPhoneのストレージは8GBです。
 - 1GBは1,000メガバイト（MB）です。
 - このiPhoneでは、すでに3GBが使用済みです。
 - 1分間のビデオは、150MBの容量を必要とします。
 
 - callout(演習):
 何分間のビデオをこのiPhoneに保存できるかユーザーに通知する文字列を作成してください。最初に計算ステップを実行し、それから文字列補間を使用して答えを表示します。次のように表示されるようにします。
 
 `約XXX分間のビデオを撮影できます。`
 
 ヒント：すべての計算はメガバイトで行ってください。
 */






/*:
 
 _Copyright © 2017 Apple Inc._
 
 _このソフトウェアおよび関連する文書ファイル（以下「ソフトウェア」という）の複製を入手した個人が、ソフトウェアを制限なく扱うこと（ソフトウェアの複製を使用、複製、修正、統合、公開、配布、サブライセンス、および販売を行う権利を含むがこれらに限定されない）およびソフトウェアを提供された個人にこれを行うことを許可することを、次の条件に基づいて無償で付与されます。_
 
 _上記の著作権通知とこの許可通知は、ソフトウェアのすべての複製または重要な部分に記載する必要があります。_
 
 _ソフトウェアは、明示的または暗黙的にかかわらず、いかなる保証を伴わず現状のまま提供されます。こうした保証には市場性、特定目的への適合性、および権利を侵害していないことに関する保証が含まれますがこれに限りません。作者または著作権所有者は、いかなる場合も、ソフトウェアに起因または関連する、もしくはソフトウェアの使用またはその他の取り扱いによるいかなる要求、損害またはその他の義務に対する責務を、契約や不法行為その他の行動の有無にかかわらず負いません。_
 */
//:[前ヘ](@previous)  |  16／16ページ
